app/Filament/Resources/Absensi/AbsensiResource/Pages/ListAbsensis.php

    protected function getHeaderActions(): array
    {
        $userId = Auth::id();
        $hariIni = now()->toDateString();
        $absensiHariIni = $userId
            ? Absensi::query()
            ->where('user_id', $userId)
            ->whereDate('tanggal', $hariIni)
            ->first()
---
select * from `absensi` where `user_id` = 1 and date(`tanggal`) = '2025-12-13' limit 1