app/Filament/Widgets/AbsensiWidget.php

    protected function getAbsensiData()
    {
        // Ambil data absensi hari ini untuk user yang sedang login
        $this->currentAbsensi = Absensi::where('user_id', Auth::id())
            ->where('tanggal', now()->toDateString())
            ->first();
---
select * from `absensi` where `user_id` = 2 and `tanggal` = '2025-12-20' limit 1