app/Filament/Widgets/AdvancedStatsOverviewWidget.php

select * from `tb_penjualan` where `tanggal_penjualan` between '2025-12-01 00:00:00' and '2025-12-31 23:59:59'
---
    protected function sumTotalPenjualanForPeriod(Carbon $from, Carbon $to): int
    {
        // // [DEBUG] Cek range tanggal: dd($from, $to);

        return Penjualan::whereBetween('tanggal_penjualan', [$from, $to])
            ->with(['items', 'jasaItems']) // Eager loading relasi untuk items dan jasa
            ->get() // Ambil semua data (Hati-hati jika datanya ribuan, bisa berat!)

select * from `tb_penjualan` where `tanggal_penjualan` between '2025-12-01 00:00:00' and '2025-12-31 23:59:59'
---
    protected function sumTotalQtyForPeriod(Carbon $from, Carbon $to): int
    {
        return Penjualan::whereBetween('tanggal_penjualan', [$from, $to])
            ->with('items')
            ->get()
            ->sum(fn($penjualan) => $penjualan->items->sum(fn($item) => (int) ($item->qty ?? 0)));

select * from `tb_pembelian` where `created_at` between '2025-12-01 00:00:00' and '2025-12-31 23:59:59'
---
    protected function sumTotalPembelianForPeriod(Carbon $from, Carbon $to): int
    {
        $pembelians = Pembelian::whereBetween('created_at', [$from, $to])
            ->with(['items', 'jasaItems'])
            ->get();