app/Filament/Widgets/MonthlyRevenueTrendChart.php

select DATE_FORMAT(tanggal_penjualan, "%Y-%m") as bulan, SUM(grand_total) as total from `tb_penjualan` where `tanggal_penjualan` between '2025-07-01 00:00:00' and '2025-12-31 23:59:59' group by `bulan` order by `bulan` asc
---
    protected function getData(): array
    {
        $end = now()->copy()->endOfMonth();
        $start = $end->copy()->subMonths(5)->startOfMonth();

        $totals = Penjualan::query()
            ->selectRaw('DATE_FORMAT(tanggal_penjualan, "%Y-%m") as bulan, SUM(grand_total) as total')
            ->whereBetween('tanggal_penjualan', [$start, $end])
            ->groupBy('bulan')
            ->orderBy('bulan')
            ->pluck('total', 'bulan');