app/Filament/Resources/PosActivityResource/Widgets/PosActivityStats.php

select count(*) as aggregate from `tb_penjualan` where `tanggal_penjualan` between '2025-12-19 00:00:00' and '2025-12-19 23:59:59'
---
    protected function countTransactionsBetween(Carbon $start, Carbon $end): int
    {
        return (int) Penjualan::query()
            ->whereBetween('tanggal_penjualan', [$start, $end])
            ->count();

select sum(`grand_total`) as aggregate from `tb_penjualan` where `tanggal_penjualan` between '2025-12-19 00:00:00' and '2025-12-19 23:59:59'
---
    protected function sumRevenueBetween(Carbon $start, Carbon $end): float
    {
        return (float) Penjualan::query()
            ->whereBetween('tanggal_penjualan', [$start, $end])
            ->sum('grand_total');

select sum(`tb_penjualan_item`.`qty`) as aggregate from `tb_penjualan_item` inner join `tb_penjualan` on `tb_penjualan`.`id_penjualan` = `tb_penjualan_item`.`id_penjualan` where `tb_penjualan`.`tanggal_penjualan` between '2025-12-19 00:00:00' and '2025-12-19 23:59:59'
---
    protected function sumProductsBetween(Carbon $start, Carbon $end): int
    {
        $salesTable = (new Penjualan())->getTable();
        $itemsTable = (new PenjualanItem())->getTable();

        return (int) PenjualanItem::query()
            ->join($salesTable, "{$salesTable}.id_penjualan", '=', "{$itemsTable}.id_penjualan")
            ->whereBetween("{$salesTable}.tanggal_penjualan", [$start, $end])
            ->sum("{$itemsTable}.qty");

select DATE(tanggal_penjualan) as day, COUNT(*) as total from `tb_penjualan` where `tanggal_penjualan` between '2025-12-13 00:00:00' and '2025-12-19 23:59:59' group by `day` order by `day` asc
---
    protected function buildTransactionSeries(Carbon $start, Carbon $end): array
    {
        $data = Penjualan::query()
            ->selectRaw('DATE(tanggal_penjualan) as day, COUNT(*) as total')
            ->whereBetween('tanggal_penjualan', [$start, $end])
            ->groupBy('day')
            ->orderBy('day')
            ->pluck('total', 'day');

select DATE(tanggal_penjualan) as day, SUM(grand_total) as total from `tb_penjualan` where `tanggal_penjualan` between '2025-12-13 00:00:00' and '2025-12-19 23:59:59' group by `day` order by `day` asc
---
    protected function buildRevenueSeries(Carbon $start, Carbon $end): array
    {
        $data = Penjualan::query()
            ->selectRaw('DATE(tanggal_penjualan) as day, SUM(grand_total) as total')
            ->whereBetween('tanggal_penjualan', [$start, $end])
            ->groupBy('day')
            ->orderBy('day')
            ->pluck('total', 'day');

select DATE(tb_penjualan.tanggal_penjualan) as day, SUM(tb_penjualan_item.qty) as total from `tb_penjualan_item` inner join `tb_penjualan` on `tb_penjualan`.`id_penjualan` = `tb_penjualan_item`.`id_penjualan` where `tb_penjualan`.`tanggal_penjualan` between '2025-12-13 00:00:00' and '2025-12-19 23:59:59' group by `day` order by `day` asc
---
    protected function buildProductSeries(Carbon $start, Carbon $end): array
    {
        $salesTable = (new Penjualan())->getTable();
        $itemsTable = (new PenjualanItem())->getTable();

        $data = PenjualanItem::query()
            ->join($salesTable, "{$salesTable}.id_penjualan", '=', "{$itemsTable}.id_penjualan")
            ->selectRaw("DATE({$salesTable}.tanggal_penjualan) as day, SUM({$itemsTable}.qty) as total")
            ->whereBetween("{$salesTable}.tanggal_penjualan", [$start, $end])
            ->groupBy('day')
            ->orderBy('day')
            ->pluck('total', 'day');