app/Filament/Resources/Akunting/LaporanInputTransaksiResource/Widgets/LaporanInputTransaksiTrendChart.php

select DATE(tanggal_transaksi) as day, kategori_transaksi, SUM(nominal_transaksi) as total from `ak_input_transaksi_tokos` where `tanggal_transaksi` between '2025-11-16 00:00:00' and '2025-12-15 23:59:59' and `kategori_transaksi` in ('pendapatan', 'beban') group by `day`, `kategori_transaksi` order by `day` asc
---
    protected function getData(): array
    {
        $end = now()->endOfDay();
        $start = $end->copy()->subDays(29)->startOfDay();

        $raw = InputTransaksiToko::query()
            ->selectRaw('DATE(tanggal_transaksi) as day, kategori_transaksi, SUM(nominal_transaksi) as total')
            ->whereBetween('tanggal_transaksi', [$start, $end])
            ->whereIn('kategori_transaksi', [KategoriAkun::Pendapatan, KategoriAkun::Beban])
            ->groupBy('day', 'kategori_transaksi')
            ->orderBy('day')
            ->get();