app/Filament/Resources/Akunting/LaporanInputTransaksiResource/Widgets/LaporanInputTransaksiStats.php

select sum(`nominal_transaksi`) as aggregate from `ak_input_transaksi_tokos` where `kategori_transaksi` = 'pendapatan' and `tanggal_transaksi` between '2025-12-01 00:00:00' and '2025-12-15 23:59:59'
---
    protected function sumByCategory(KategoriAkun $category, Carbon $start, Carbon $end): int
    {
        return (int) InputTransaksiToko::query()
            ->where('kategori_transaksi', $category)
            ->whereBetween('tanggal_transaksi', [$start, $end])
            ->sum('nominal_transaksi');

select DATE(tanggal_transaksi) as day, SUM(nominal_transaksi) as total from `ak_input_transaksi_tokos` where `kategori_transaksi` = 'pendapatan' and `tanggal_transaksi` between '2025-12-01 00:00:00' and '2025-12-15 23:59:59' group by `day`
---
    protected function dailyTotals(KategoriAkun $category, Carbon $start, Carbon $end): array
    {
        $raw = InputTransaksiToko::query()
            ->selectRaw('DATE(tanggal_transaksi) as day, SUM(nominal_transaksi) as total')
            ->where('kategori_transaksi', $category)
            ->whereBetween('tanggal_transaksi', [$start, $end])
            ->groupBy('day')
            ->pluck('total', 'day')
            ->all();